# Sort, Filter, Aggregation, Grouping, Pivot, Concatenation, Merge/Join

In [1]:
import pandas as pd

data = {
    'Team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'Age': [23, 25, 30, 22, 29, 24],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edward', 'Frank']
}
df = pd.DataFrame(data)

In [2]:
df

  Team  Age     Name
0    A   23    Alice
1    A   25      Bob
2    B   30  Charlie
3    B   22    David
4    B   29   Edward
5    C   24    Frank

## Filter

In [3]:
df1 = df.filter(items=['Name', 'Age'])
df1

      Name  Age
0    Alice   23
1      Bob   25
2  Charlie   30
3    David   22
4   Edward   29
5    Frank   24

In [4]:
df2 = df[df.apply(lambda row: row.astype(str).str.contains('a').any(), axis=1)]
df2

  Team  Age     Name
2    B   30  Charlie
3    B   22    David
4    B   29   Edward
5    C   24    Frank

### Note:
1. df.apply(): Apply a function along the specified axis.
2. lambda row: row.astype(str).str.contains('a').any(): 
    A lambda function that converts each row to a string, checks if 'a' is present in any cell, and returns True if found.

3. In the context of the apply function:
    + Using axis=0 means the function is applied to each column.
    + Using axis=1 means the function is applied to each row.

## Groupby

In [5]:
result = df.groupby('Team')['Age'].agg(['count'])


result

      count
Team
A         2
B         3
C         1

In [6]:
result = df.groupby('Team')['Age'].agg(['count', 'sum', 'max', 'min', 'mean'])

result

      count  sum  max  min  mean
Team
A         2   48   25   23  24.0
B         3   81   30   22  27.0
C         1   24   24   24  24.0

## Example of Pivot table

In [7]:
import pandas as pd

data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-02',
             '2024-01-03', '2024-01-03', '2024-01-03', '2024-01-04', '2024-01-04', '2024-01-04'],
    'Region': ['North', 'South', 'East', 'North', 'South', 'East', 'North', 'South', 'East', 'North', 'South', 'East'],
    'Product': ['A', 'A', 'B', 'A', 'A', 'B', 'B', 'B', 'A', 'B', 'B', 'A'],
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Electronics', 'Electronics', 'Furniture',
                 'Furniture', 'Furniture', 'Electronics', 'Furniture', 'Furniture', 'Electronics'],
    'Sales': [200, 150, 100, 220, 180, 130, 250, 200, 160, 270, 210, 190],
    'Quantity': [10, 7, 5, 11, 9, 6, 12, 10, 8, 13, 11, 9],
    'Discount': [5, 3, 2, 6, 4, 3, 7, 5, 4, 8, 6, 5]
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])

print(df)

         Date Region Product     Category  Sales  Quantity  Discount
0  2024-01-01  North       A  Electronics    200        10         5
1  2024-01-01  South       A  Electronics    150         7         3
2  2024-01-01   East       B    Furniture    100         5         2
3  2024-01-02  North       A  Electronics    220        11         6
4  2024-01-02  South       A  Electronics    180         9         4
5  2024-01-02   East       B    Furniture    130         6         3
6  2024-01-03  North       B    Furniture    250        12         7
7  2024-01-03  South       B    Furniture    200        10         5
8  2024-01-03   East       A  Electronics    160         8         4
9  2024-01-04  North       B    Furniture    270        13         8
10 2024-01-04  South       B    Furniture    210        11         6
11 2024-01-04   East       A  Electronics    190         9         5

### Example 1: Sum of Sales by Region and Product

Create a pivot table to sum the sales by Region and Product:

In [8]:
pivot1 = df.pivot_table(values='Sales', columns='Region', aggfunc='sum')
print(pivot1)

Region  East  North  South
Sales    580    940    740

In [9]:
pivot1 = df.pivot_table(values='Sales', index='Date', columns='Region', aggfunc='sum')
print(pivot1)

Region      East  North  South
Date
2024-01-01   100    200    150
2024-01-02   130    220    180
2024-01-03   160    250    200
2024-01-04   190    270    210

### Example 2: Sum of Sales by Region and Product
Create a pivot table to sum the sales by Region and Product:

In [10]:
pivot1 = df.pivot_table(values='Sales', index='Region', columns='Product', aggfunc='sum')
print(pivot1)

Product    A    B
Region
East     350  230
North    420  520
South    330  410

### Example 3: Multiple Aggregation Functions

Create a pivot table to show both the sum and the mean of sales by Date and Region:

In [11]:
pivot2 = df.pivot_table(values='Sales', index='Date', columns='Region', aggfunc=['sum', 'mean'])
print(pivot2)

            sum               mean
Region     East North South   East  North  South
Date
2024-01-01  100   200   150  100.0  200.0  150.0
2024-01-02  130   220   180  130.0  220.0  180.0
2024-01-03  160   250   200  160.0  250.0  200.0
2024-01-04  190   270   210  190.0  270.0  210.0

### Example 4: Multiple Aggregation Functions (Sum and Mean)

Create a pivot table to show both the sum and the mean of sales by Category and Product:

In [12]:
pivot2 = df.pivot_table(values='Sales', index='Category', columns='Product', aggfunc=['sum', 'mean'], fill_value=0)
print(pivot2)

              sum              mean
Product         A     B           A           B
Category
Electronics  1100     0  183.333333    0.000000
Furniture       0  1160    0.000000  193.333333

### Example 3: Pivot Table with Multiple Index and Columns, Including Quantity and Discount

Create a pivot table to summarize sales, quantity, and discount by Date and Region:

In [13]:
pivot3 = df.pivot_table(values=['Sales', 'Quantity', 'Discount'], index=['Date', 'Region'], columns='Product', aggfunc='sum', fill_value=0)
print(pivot3)

                  Discount    Quantity     Sales
Product                  A  B        A   B     A    B
Date       Region
2024-01-01 East          0  2        0   5     0  100
           North         5  0       10   0   200    0
           South         3  0        7   0   150    0
2024-01-02 East          0  3        0   6     0  130
           North         6  0       11   0   220    0
           South         4  0        9   0   180    0
2024-01-03 East          4  0        8   0   160    0
           North         0  7        0  12     0  250
           South         0  5        0  10     0  200
2024-01-04 East          5  0        9   0   190    0
           North         0  8        0  13     0  270
           South         0  6        0  11     0  210

## Concatenation

In [14]:
# DataFrame 1
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
# DataFrame 2
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
})
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [16]:
# DataFrame 3
df3 = pd.DataFrame({
    'E': ['E0', 'E1', 'E2', 'E3'],
    'F': ['F0', 'F1', 'F2', 'F3'],
    'G': ['G0', 'G1', 'G2', 'G3'],
    'H': ['H0', 'H1', 'H2', 'H3']
})

df3

    E   F   G   H
0  E0  F0  G0  H0
1  E1  F1  G1  H1
2  E2  F2  G2  H2
3  E3  F3  G3  H3

### Example 1: Concatenating Along Rows
Concatenate df1 and df2 along rows (axis=0):

In [17]:
result1 = pd.concat([df1, df2], axis=0)
print(result1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [18]:
# Resetting the index
result1_reset = result1.reset_index(drop=True)
print(result1_reset)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

## Concatenating with Different Indices
Let's modify df2 to have different indices and concatenate along rows:

In [19]:
df2.index = [4, 5, 6, 7]
result3 = pd.concat([df1, df2], axis=0)
print(result3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

### Example 2: Concatenating Along Columns
Concatenate df1 and df3 along columns (axis=1):

In [20]:
result2 = pd.concat([df1, df3], axis=1)
print(result2)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  E0  F0  G0  H0
1  A1  B1  C1  D1  E1  F1  G1  H1
2  A2  B2  C2  D2  E2  F2  G2  H2
3  A3  B3  C3  D3  E3  F3  G3  H3

Drop null

In [21]:
import pandas as pd
import numpy as np

data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, 2, 3, 4, 5],
    'D': [np.nan, np.nan, np.nan, 4, 5]
}
df = pd.DataFrame(data)
print(df)

     A    B  C    D
0  1.0  NaN  1  NaN
1  2.0  2.0  2  NaN
2  NaN  3.0  3  NaN
3  4.0  NaN  4  4.0
4  5.0  5.0  5  5.0

## Example 1: Drop Rows with Any Missing Values
Drop all rows that contain any NaN values:

In [22]:
df1 = df.dropna()
print(df1)

     A    B  C    D
4  5.0  5.0  5  5.0

## Example 2: Drop Columns with Any Missing Values
Drop all columns that contain any NaN values:

In [23]:
df2 = df.dropna(axis=1)
print(df2)

   C
0  1
1  2
2  3
3  4
4  5

## Example 3: Drop Rows with All Missing Values
Drop only those rows where all elements are NaN:

In [24]:
df3 = df.dropna(how='all')
print(df3)

     A    B  C    D
0  1.0  NaN  1  NaN
1  2.0  2.0  2  NaN
2  NaN  3.0  3  NaN
3  4.0  NaN  4  4.0
4  5.0  5.0  5  5.0

## Example 4: Drop Columns with All Missing Values
Drop only those columns where all elements are NaN:

In [25]:
df4 = df.dropna(axis=1, how='all')
print(df4)

     A    B  C    D
0  1.0  NaN  1  NaN
1  2.0  2.0  2  NaN
2  NaN  3.0  3  NaN
3  4.0  NaN  4  4.0
4  5.0  5.0  5  5.0

## Example 5: Drop Rows with Missing Values in Specific Columns
Drop rows that contain NaN values in the specified columns:

In [26]:
df5 = df.dropna(subset=['A', 'B'])
print(df5)

     A    B  C    D
1  2.0  2.0  2  NaN
4  5.0  5.0  5  5.0

## Example 6: Drop Rows with a Threshold of Non-NaN Values
Drop rows that have less than a certain number of non-NaN values:

In [27]:
df6 = df.dropna(thresh=3)
print(df6)

     A    B  C    D
1  2.0  2.0  2  NaN
3  4.0  NaN  4  4.0
4  5.0  5.0  5  5.0

## Example 7: Drop Columns with a Threshold of Non-NaN Values
Drop columns that have less than a certain number of non-NaN values:

In [28]:
df7 = df.dropna(axis=1, thresh=4)
print(df7)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3
3  4.0  4
4  5.0  5